Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Use Weblate wordmarks in text to truthfully refer to and/or link to unmodified Weblate programs, products, services and technologies.
sv: AnvÃ¤nd Weblate-ordmÃ¤rken i text fÃ¶r att pÃ¥ ett korrekt sÃ¤tt hÃ¤nvisa till och/eller lÃ¤nka till ofÃ¶rÃ¤ndrade Weblate-program, produkter, tjÃ¤nster och tekniker.

source: Use Weblate logos in visuals to truthfully refer to and/or to link to the applicable programs, products, services and technologies hosted on Weblate servers.
sv: AnvÃ¤nd Weblate-logotyper i visuella material fÃ¶r att pÃ¥ ett korrekt sÃ¤tt hÃ¤nvisa till och/eller lÃ¤nka till tillÃ¤mpliga program, produkter, tjÃ¤nster och tekniker som finns pÃ¥ Weblate-servrar.

source: Use Weblate wordmarks to explain that your software is based on Weblate's open-source code or is compatible with Weblate's software.
sv: AnvÃ¤nd Weblate-ordmÃ¤rken fÃ¶r att fÃ¶rklara att din programvara Ã¤r baserad pÃ¥ Weblates Ã¶ppen kÃ¤llkod eller Ã¤r kompatibel med Weblates programvara.

source: Describe a social media account, page, or community in accordance with theÂ Social Media Guidelines.
sv: Beskriv ett konto, en sida eller en community pÃ¥ sociala medier i enlighet med riktlinjerna fÃ¶r sociala medier.

source: All other uses of a Weblate trademark require our prior written permission. This includes any use of a Weblate trademark in a domain name.
sv: All annan anvÃ¤ndning av ett Weblate-varumÃ¤rke krÃ¤ver vÃ¥rt skriftliga tillstÃ¥nd i fÃ¶rvÃ¤g. Detta inkluderar all anvÃ¤ndning av ett Weblate-varumÃ¤rke i ett domÃ¤nnamn.

source: When allowed, how should I use a Weblate trademark?
sv: NÃ¤r det Ã¤r tillÃ¥tet, hur ska jag anvÃ¤nda ett Weblate-varumÃ¤rke?

source: General Guidelines
sv: AllmÃ¤nna riktlinjer

source: **Do:**
sv: **GÃ¶r:**

source: Use the Weblate trademark exactly as shown in the list above.
sv: AnvÃ¤nd varumÃ¤rket Weblate exakt som det visas i listan ovan.

source: Use Weblate wordmarks only as a noun. Avoid Adjectives and Verbs. Do not use them in plural.
sv: AnvÃ¤nd Weblate-ordmÃ¤rken endast som substantiv. Undvik adjektiv och verb. AnvÃ¤nd dem inte i plural.

source: **Don't:**
sv: **GÃ¶r inte:**

source: Don't use Weblate trademarks in the name of your business, product, service, app, domain name, publication, or other offering.
sv: AnvÃ¤nd inte Weblates varumÃ¤rken i namnet pÃ¥ ditt fÃ¶retag, din produkt, tjÃ¤nst, app, domÃ¤nnamn, publikation eller annat erbjudande.

source: Don't use marks, logos, company names, slogans, domain names, or designs that are confusingly like Weblate trademarks.
sv: AnvÃ¤nd inte mÃ¤rken, logotyper, fÃ¶retagsnamn, slogans, domÃ¤nnamn eller designer som kan fÃ¶rvÃ¤xlas med Weblates varumÃ¤rken.

source: Don't use Weblate trademarks in a way that incorrectly implies affiliation with, or sponsorship, endorsement, or approval by Weblate of your products or services.
sv: AnvÃ¤nd inte Weblates varumÃ¤rken pÃ¥ ett sÃ¤tt som felaktigt antyder att Weblate Ã¤r knutet till, sponsrar, stÃ¶der eller godkÃ¤nner dina produkter eller tjÃ¤nster.

source: Don't display Weblate trademarks more prominently than your product, service, or company name.
sv: Visa inte Weblates varumÃ¤rken mer framtrÃ¤dande Ã¤n ditt produkt-, tjÃ¤nste- eller fÃ¶retagsnamn.

source: Don't use Weblate trademarks on merchandise for sale (e.g., selling t-shirts, mugs, etc.).
sv: AnvÃ¤nd inte Weblates varumÃ¤rken pÃ¥ varor som sÃ¤ljs (t.ex. t-shirts, muggar etc.).

source: Don't use Weblate trademarks for any other form of commercial use (e.g. offering technical support services).
sv: AnvÃ¤nd inte Weblates varumÃ¤rken fÃ¶r nÃ¥gon annan form av kommersiellt bruk (t.ex. fÃ¶r att erbjuda teknisk support).

source: Don't modify Weblate's trademarks, abbreviate them, or combine them with any other symbols, words, or images, or incorporate them into a tagline or slogan.
sv: Ãndra inte Weblates varumÃ¤rken, fÃ¶rkorta dem inte, kombinera dem inte med andra symboler, ord eller bilder och infÃ¶rliva dem inte i en slogan eller ett motto.

source: Social Media Guidelines
sv: Riktlinjer fÃ¶r sociala medier

source: In addition to the General Guidelines above, the name and handle of your social media account and all pages cannot begin with an Weblate trademark. In addition, Weblate logos cannot be used in a way that might suggest affiliation with Weblate, including, but not limited to, the account, profile, or header images. The only exception to these requirements is if you've received prior permission from Weblate.
sv: UtÃ¶ver de allmÃ¤nna riktlinjerna ovan fÃ¥r namnet och anvÃ¤ndarnamnet pÃ¥ ditt sociala mediekonto och alla sidor inte bÃ¶rja med ett Weblate-varumÃ¤rke. Dessutom fÃ¥r Weblate-logotyper inte anvÃ¤ndas pÃ¥ ett sÃ¤tt som kan antyda en anknytning till Weblate, inklusive, men inte begrÃ¤nsat till, kontot, profilen eller rubrikbilderna. Det enda undantaget frÃ¥n dessa krav Ã¤r om du har fÃ¥tt fÃ¶rhandsgodkÃ¤nnande frÃ¥n Weblate.

source: For example, you cannot name your account, page, or community "Weblate Representatives" or "Weblate Software". However, it would be acceptable to name your account, page, or community "Fans of Weblate" or "Information about Weblate Software" if you do not use the Weblate trademarks or Weblate logos or otherwise suggest any affiliation with Weblate.
sv: Du fÃ¥r till exempel inte namnge ditt konto, din sida eller din community "Weblate Representatives" eller "Weblate Software". Det Ã¤r dock acceptabelt att namnge ditt konto, din sida eller din community "Fans of Weblate" eller "Information about Weblate Software" om du inte anvÃ¤nder Weblates varumÃ¤rken eller logotyper eller pÃ¥ annat sÃ¤tt antyder nÃ¥gon anknytning till Weblate.

source: Open-Source Project Guidelines
sv: Riktlinjer fÃ¶r Ã¶ppen kÃ¤llkodsprojekt

source: The specific license for each of Weblate's software products and code says what you can and cannot do with the code itself but does not give permission to use Weblate's trademarks. If you choose to build on or modify Weblate's open-source code for your own project,
sv: Den specifika licensen fÃ¶r var och en av Weblates programvaruprodukter och kod anger vad du fÃ¥r och inte fÃ¥r gÃ¶ra med sjÃ¤lva koden, men ger inte tillstÃ¥nd att anvÃ¤nda Weblates varumÃ¤rken. Om du vÃ¤ljer att bygga vidare pÃ¥ eller modifiera Weblates Ã¶ppen kÃ¤llkod fÃ¶r ditt eget projekt,

source: **You Must:**
sv: **Du mÃ¥ste:**

source: Follow the terms of the Open-Source Licenses for Weblate software products and code (mainly GPLv3).
sv: FÃ¶lj villkoren i Ã¶ppen kÃ¤llkodslicensen fÃ¶r Weblate-programvaruprodukter och kod (frÃ¤mst GPLv3).

source: Choose branding, logos, and trademarks that denotes your own unique identity to clearly signal to users that there is no affiliation with or endorsement by Weblate.
sv: VÃ¤lj varumÃ¤rken, logotyper och varumÃ¤rken som visar din egen unika identitet fÃ¶r att tydligt signalera till anvÃ¤ndarna att det inte finns nÃ¥gon anknytning till eller stÃ¶d frÃ¥n Weblate.

source: Follow the General Guidelines, above.
sv: FÃ¶lj de allmÃ¤nna riktlinjerna ovan.

source: **You Must NOT:**
sv: **Du fÃ¥r INTE:**

source: Use any Weblate trademark in connection with the user-facing name or branding of your project.
sv: AnvÃ¤nd inte nÃ¥got av Weblates varumÃ¤rken i samband med det namn eller varumÃ¤rke som visas fÃ¶r anvÃ¤ndarna i ditt projekt.

source: Use any Weblate trademark or any part of any Weblate trademark to incorrectly suggest or give the impression your software is published by, affiliated with, or endorsed by Weblate.
sv: AnvÃ¤nda nÃ¥got av Weblates varumÃ¤rken eller nÃ¥gon del av nÃ¥got av Weblates varumÃ¤rken fÃ¶r att felaktigt antyda eller ge intryck av att din programvara publiceras av, Ã¤r ansluten till eller stÃ¶ds av Weblate.

source: For example, please do not name your project, [Something]-Weblate, or Weblate-[Something]
sv: Namnge till exempel inte ditt projekt [NÃ¥got]-Weblate eller Weblate-[NÃ¥got]

source: **You May:**
sv: **Du fÃ¥r:**

source: State in words (not using logos or images) that your product "works with" or "is compatible" with certain Weblate products, if that is true.
sv: Ange med ord (utan att anvÃ¤nda logotyper eller bilder) att din produkt "fungerar med" eller "Ã¤r kompatibel" med vissa Weblate-produkter, om sÃ¥ Ã¤r fallet.

source: State in words (not using logos or images) that your project is based on Weblate open-source technology, if that is true, if you also include a statement that your project is not officially associated with Weblate or its products.
sv: Ange med ord (utan att anvÃ¤nda logotyper eller bilder) att ditt projekt baseras pÃ¥ Weblates Ã¶ppen kÃ¤llkodsteknik, om sÃ¥ Ã¤r fallet, och inkludera Ã¤ven ett uttalande om att ditt projekt inte Ã¤r officiellt associerat med Weblate eller dess produkter.

source: For instance, you may state that your project:
sv: Du kan till exempel ange att ditt projekt:

source: "is proudly built from Weblate's open-source software"
sv: "Ã¤r stolt byggd med Weblates Ã¶ppen kÃ¤llkodsprogramvara"

source: as long as you also include the statement equally prominently:
sv: sÃ¥ lÃ¤nge du ocksÃ¥ inkluderar fÃ¶ljande uttalande pÃ¥ lika framtrÃ¤dande plats:

source: "[Brand Name] and [Product Name] are not officially associated with Weblate or its products."
sv: "[VarumÃ¤rke] och [Produktnamn] har ingen officiell koppling till Weblate eller dess produkter."

source: Weblate Community Guidelines
sv: Weblate-gemenskapens riktlinjer

source: Various permissions to use Weblate Trademarks have been provided to various members of the Weblate Community, and these Weblate Trademark Guidelines do not alter any such previously granted permissions.
sv: Olika behÃ¶righeter att anvÃ¤nda Weblate-varumÃ¤rken har beviljats olika medlemmar i Weblate-gemenskapen, och dessa riktlinjer fÃ¶r Weblate-varumÃ¤rken Ã¤ndrar inte nÃ¥gra tidigare beviljade behÃ¶righeter.

source: Translation component alerts
sv: ÃversÃ¤ttningskomponentvarningar

source: Shows errors in the Weblate configuration or the translation project for any given translation component. Guidance on how to address found issues is also offered.
sv: Visar fel i Weblate-konfigurationen eller Ã¶versÃ¤ttningsprojektet fÃ¶r en given Ã¶versÃ¤ttningskomponent. VÃ¤gledning om hur man Ã¥tgÃ¤rdar upptÃ¤ckta problem erbjuds ocksÃ¥.

source: Currently the following is covered:
sv: FÃ¶r nÃ¤rvarande omfattas fÃ¶ljande:

source: Duplicated source strings in translation files
sv: Duplicerade kÃ¤llstrÃ¤ngar i Ã¶versÃ¤ttningsfiler

source: Duplicated languages within translations
sv: Duplicerade sprÃ¥k i Ã¶versÃ¤ttningar

source: Merge, update, or push failures in the repository
sv: Sammanfoga, uppdatera eller push-fel i arkivet

source: Parse errors in the translation files
sv: Parseringsfel i Ã¶versÃ¤ttningsfilerna

source: Billing limits (see :ref:`billing`)
sv: FaktureringsgrÃ¤nser (se :ref:`billing`)

source: Repository containing too many outgoing or missing commits
sv: Repository som innehÃ¥ller fÃ¶r mÃ¥nga utgÃ¥ende eller saknade commits

source: Missing licenses
sv: Saknade licenser

source: Errors when running add-on (see :doc:`/admin/addons`)
sv: Fel vid kÃ¶rning av tillÃ¤gg (se :doc:`/admin/addons`)

source: Broken :ref:`component`
sv: Trasig :ref:`component`

source: Broken URLs
sv: Trasiga URL:er

source: Unused screenshots
sv: OanvÃ¤nda skÃ¤rmdumpar

source: Ambiguous language code
sv: Tvetydig sprÃ¥kkod

source: Unused new base in component settings
sv: OanvÃ¤nd ny bas i komponentinstÃ¤llningar

source: Duplicate file mask used for linked components
sv: Duplikatfilmask som anvÃ¤nds fÃ¶r lÃ¤nkade komponenter

source: Component seems unused
sv: Komponenten verkar vara oanvÃ¤nd

source: The alerts are updated daily, or on related change (for example when :ref:`component` is changed or when repository is updated).
sv: Varningarna uppdateras dagligen eller vid relaterade Ã¤ndringar (till exempel nÃ¤r :ref:`component` Ã¤ndras eller nÃ¤r arkivet uppdateras).

source: Alerts are listed on each respective component page as :guilabel:`Alerts`. If it is missing, the component clears all current checks. Alerts can not be ignored, but will disappear once the underlying problem has been fixed.
sv: Varningar listas pÃ¥ respektive komponent sida som :guilabel:`Varningar`. Om det saknas, rensar komponenten alla aktuella kontroller. Varningar kan inte ignoreras, men fÃ¶rsvinner nÃ¤r det underliggande problemet har Ã¥tgÃ¤rdats.

source: A component with both duplicated strings and languages looks like this:
sv: En komponent med bÃ¥de duplicerade strÃ¤ngar och sprÃ¥k ser ut sÃ¥ hÃ¤r:

source: Building a translators community
sv: Bygga en Ã¶versÃ¤ttargemenskap

source: Following these recommendations supports the creation of a full, multilingual post-editing tool. Good translations are defined through the systemic-functional model of House which aims at a contextual correct translation. Write your own `post-editing guide <https://en.wikipedia.org/wiki/Postediting>`_ and alter these recommendations to fit your own definitions. In most cases the `browser-plugin of languageTool <https://languagetool.org/#firefox_chrome>`_ is useful as a proof-reading tool.
sv: Att fÃ¶lja dessa rekommendationer bidrar till skapandet av ett komplett, flersprÃ¥kigt verktyg fÃ¶r efterredigering. Bra Ã¶versÃ¤ttningar definieras genom Houses systemfunktionella modell, som syftar till en kontextuellt korrekt Ã¶versÃ¤ttning. Skriv din egen `efterredigeringsguide <https://en.wikipedia.org/wiki/Postediting>`_ och anpassa dessa rekommendationer efter dina egna definitioner. I de flesta fall Ã¤r `webblÃ¤sarpluginen languageTool <https://languagetool.org/#firefox_chrome>`_ anvÃ¤ndbar som korrekturlÃ¤sningsverktyg.

source: Many times translators will find problems with the source strings. Make sure it is easy for them to report such problems. To gather this feedback, you can set up the :ref:`component-repoweb` field on your Weblate component, for translators to propose their changes to the upstream repository. You can also receive translator comments if you setup :ref:`component-report_source_bugs`.
sv: MÃ¥nga gÃ¥nger stÃ¶ter Ã¶versÃ¤ttare pÃ¥ problem med kÃ¤llstrÃ¤ngarna. Se till att det Ã¤r enkelt fÃ¶r dem att rapportera sÃ¥dana problem. FÃ¶r att samla in denna feedback kan du stÃ¤lla in fÃ¤ltet :ref:`component-repoweb` i din Weblate-komponent, sÃ¥ att Ã¶versÃ¤ttarna kan fÃ¶reslÃ¥ sina Ã¤ndringar till uppstrÃ¶msrepositoriet. Du kan ocksÃ¥ ta emot kommentarer frÃ¥n Ã¶versÃ¤ttare om du stÃ¤ller in :ref:`component-report_source_bugs`.

source: The :guilabel:`Community localization checklist` which can be found in the menu of each component can give you guidance to make your localization process easy for community translators.
sv: :guilabel:`Checklista fÃ¶r lokalisering av communityn`, som finns i menyn fÃ¶r varje komponent, kan ge dig vÃ¤gledning fÃ¶r att underlÃ¤tta lokaliseringsprocessen fÃ¶r communityns Ã¶versÃ¤ttare.

source: Terminology management
sv: Terminologihantering

source: Post-editing of MT with terminology assignment influences each level of the translation process. The machine translation system can be adapted to the specific vocabulary and style with a continued training or `neural fuzzy repair <https://aclanthology.org/P19-1175.pdf>`_. `Import <https://docs.weblate.org/en/latest/admin/memory.html#imported-translation-memory>`_ your existing translation memory into weblate or create an initial scope with your basic terminology. In the end the lector should be instructed with additional terminology documents to guarantee a good knowledge and output in the field.
sv: Efterredigering av maskinÃ¶versÃ¤ttning med terminologitilldelning pÃ¥verkar varje nivÃ¥ i Ã¶versÃ¤ttningsprocessen. MaskinÃ¶versÃ¤ttningssystemet kan anpassas till specifikt ordfÃ¶rrÃ¥d och stil med fortsatt trÃ¤ning eller `neural fuzzy repair <https://aclanthology.org/P19-1175.pdf>`_. `Importera <https://docs.weblate.org/en/latest/admin/memory.html#imported-translation-memory>`_ ditt befintliga Ã¶versÃ¤ttningsminne till weblate eller skapa ett initialt omfÃ¥ng med din grundlÃ¤ggande terminologi. I slutÃ¤ndan bÃ¶r lektorn instrueras med ytterligare terminologidokument fÃ¶r att garantera goda kunskaper och resultat inom omrÃ¥det.

source: The quality of the automatic translation (often measured with the BLEU-score) correlates with editing time [1]. Choose a machine backend which supports the needed languages and domains. Make clear how the translation backend functions and which quality the post-editor has to expect.
sv: Kvaliteten pÃ¥ den automatiska Ã¶versÃ¤ttningen (som ofta mÃ¤ts med BLEU-poÃ¤ng) korrelerar med redigeringstiden [1]. VÃ¤lj en maskinbackend som stÃ¶der de sprÃ¥k och domÃ¤ner som behÃ¶vs. FÃ¶rtydliga hur Ã¶versÃ¤ttningsbackenden fungerar och vilken kvalitet efterredigeraren kan fÃ¶rvÃ¤nta sig.

source: Review translations
sv: Granska Ã¶versÃ¤ttningar

source: The translations should be reviewed by a second person after the post-editing. With an impartial and competent reviewer, the two people rule reduces the errors and improves the quality and consistency of the content. Providing reviewers with previews or alpha translations will make for the best review. Screenshots, explanations also help to review the strings in context.
sv: ÃversÃ¤ttningarna bÃ¶r granskas av en andra person efter efterredigeringen. Med en opartisk och kompetent granskare minskar tvÃ¥personsregeln antalet fel och fÃ¶rbÃ¤ttrar innehÃ¥llets kvalitet och konsekvens. Att fÃ¶rse granskarna med fÃ¶rhandsgranskningar eller alfaÃ¶versÃ¤ttningar ger bÃ¤sta mÃ¶jliga granskning. SkÃ¤rmdumpar och fÃ¶rklaringar hjÃ¤lper ocksÃ¥ till att granska strÃ¤ngarna i sitt sammanhang.

source: Structured feedback
sv: Strukturerad Ã¥tergivning

source: There are many :doc:`/user/checks` in Weblate that provide structured feedback on the quality of the translations. They also give visual feedback during translation. This prevents recurring mistakes, and helps translators to understand how the code works.
sv: Det finns mÃ¥nga :doc:`/user/checks` i Weblate som ger strukturerad feedback om Ã¶versÃ¤ttningarnas kvalitet. De ger ocksÃ¥ visuell feedback under Ã¶versÃ¤ttningen. Detta fÃ¶rhindrar Ã¥terkommande misstag och hjÃ¤lper Ã¶versÃ¤ttarna att fÃ¶rstÃ¥ hur koden fungerar.

source: Translation definition
sv: ÃversÃ¤ttningsdefinition

source: In addition to the mentalistic and impact-based definitions which make a strong reduction, the text-based linguistic approach fits best with the implemented translation methods. A well-formulated theory for translation evaluation is House's systemic-functional model, which focuses on the relation between original and translation. The model assumes that translation is an attempt to keep the semantic, pragmatic, and textual meaning of a text equivalent when crossing from one linguistic code to another.
sv: FÃ¶rutom de mentalistiska och effektbaserade definitionerna, som innebÃ¤r en kraftig reduktion, passar det textbaserade sprÃ¥kliga tillvÃ¤gagÃ¥ngssÃ¤ttet bÃ¤st med de implementerade Ã¶versÃ¤ttningsmetoderna. En vÃ¤lformulerad teori fÃ¶r Ã¶versÃ¤ttningsutvÃ¤rdering Ã¤r Houses systemfunktionella modell, som fokuserar pÃ¥ relationen mellan original och Ã¶versÃ¤ttning. Modellen utgÃ¥r frÃ¥n att Ã¶versÃ¤ttning Ã¤r ett fÃ¶rsÃ¶k att behÃ¥lla den semantiska, pragmatiska och textuella betydelsen av en text nÃ¤r den Ã¶verfÃ¶rs frÃ¥n ett sprÃ¥kligt kodsystem till ett annat.

source: The degree of quality of a translation is based on the degree of equivalence, the correspondence between the text profile and the text function. Because it cannot be calculated automatically, sufficient information should be collected to enable a uniform human evaluation. The two main parameters of agreement in a corresponding model are the macro-context â i.e. embedding in a larger social and literary context â and the micro-context consisting of field, tenor and mode.
sv: ÃversÃ¤ttningens kvalitet baseras pÃ¥ graden av ekvivalens, det vill sÃ¤ga Ã¶verensstÃ¤mmelsen mellan textprofilen och textfunktionen. Eftersom detta inte kan berÃ¤knas automatiskt bÃ¶r tillrÃ¤cklig information samlas in fÃ¶r att mÃ¶jliggÃ¶ra en enhetlig mÃ¤nsklig utvÃ¤rdering. De tvÃ¥ viktigaste parametrarna fÃ¶r Ã¶verensstÃ¤mmelse i en motsvarande modell Ã¤r makrokontexten â det vill sÃ¤ga inbÃ¤ddningen i ett stÃ¶rre socialt och litterÃ¤rt sammanhang â och mikrokontexten som bestÃ¥r av fÃ¤lt, tenor och modus.

source: Marina Sanchez-Torron and Philipp Koehn in Machine Translation Quality and Post-Editor Productivity, Figure 1: https://www.cs.jhu.edu/~phi/publications/machine-translation-quality.pdf
sv: Marina Sanchez-Torron och Philipp Koehn i Machine Translation Quality and Post-Editor Productivity, figur 1: https://www.cs.jhu.edu/~phi/publications/machine-translation-quality.pdf

source: Joanna Best und Sylvia Kalina. Ãbersetzen und Dolmetschen: eine Orientierungshilfe. A. Francke Verlag TÃ¼bingen und Base, 2002. MÃ¶glichkeiten der Ãbersetzungskritik starting on page number 101
sv: Joanna Best och Sylvia Kalina. ÃversÃ¤ttning och tolkning: en orienteringsguide. A. Francke Verlag TÃ¼bingen och Base, 2002. MÃ¶jligheter fÃ¶r Ã¶versÃ¤ttningskritik frÃ¥n sidan 101

source: neural fuzzy repair, Bram BultÃ© and Arda Tezcan in Neural Fuzzy Repair: Integrating Fuzzy Matches into Neural Machine Translation, 2019 https://aclanthology.org/P19-1175.pdf
sv: neuronal fuzzy-korrigering, Bram BultÃ© och Arda Tezcan i Neural Fuzzy Repair: Integrating Fuzzy Matches into Neural Machine Translation, 2019 https://aclanthology.org/P19-1175.pdf

source: Translating software using GNU gettext
sv: ÃversÃ¤ttning av programvara med GNU gettext

source: `GNU gettext`_ is one of the most widely used tool for internationalization of free software. It provides a simple yet flexible way to localize the software. It has great support for plurals, it can add further context to the translated string and there are quite a lot of tools built around it. Of course it has great support in Weblate (see :ref:`gettext` file format description).
sv: `GNU gettext`_ Ã¤r ett av de mest anvÃ¤nda verktygen fÃ¶r internationalisering av fri programvara. Det erbjuder ett enkelt men flexibelt sÃ¤tt att lokalisera programvara. Det har utmÃ¤rkt stÃ¶d fÃ¶r pluralformer, kan lÃ¤gga till ytterligare kontext till den Ã¶versatta strÃ¤ngen och det finns en hel del verktyg som bygger pÃ¥ det. Naturligtvis har det utmÃ¤rkt stÃ¶d i Weblate (se :ref:`gettext` filformatbeskrivning).

source: If you are about to use it in proprietary software, please consult licensing first, it might not be suitable for you.
sv: Om du tÃ¤nker anvÃ¤nda det i proprietÃ¤r programvara, vÃ¤nligen konsultera licensvillkoren fÃ¶rst, det kanske inte Ã¤r lÃ¤mpligt fÃ¶r dig.

source: GNU gettext can be used from a variety of languages (C, Python, PHP, Ruby, JavaScript and many more) and usually the UI frameworks already come with some support for it. The standard usage is through the `gettext()` function call, which is often aliased to `_()` to make the code simpler and easier to read.
sv: GNU gettext kan anvÃ¤ndas frÃ¥n en rad olika sprÃ¥k (C, Python, PHP, Ruby, JavaScript och mÃ¥nga fler) och vanligtvis har UI-ramverken redan ett visst stÃ¶d fÃ¶r det. StandardanvÃ¤ndningen sker genom funktionsanropet `gettext()`, som ofta aliasas till `_()` fÃ¶r att gÃ¶ra koden enklare och lÃ¤ttare att lÃ¤sa.

source: Additionally it provides `pgettext()` call to provide additional context to translators and `ngettext()` which can handle plural types as defined for target language.
sv: Dessutom tillhandahÃ¥ller den `pgettext()`-anrop fÃ¶r att ge Ã¶versÃ¤ttarna ytterligare kontext och `ngettext()` som kan hantera pluralformer enligt definitionen fÃ¶r mÃ¥lsprÃ¥ket.
